test_examples/tube_OpenFoam3d_abaqus3d/CFD_test0/0/ccz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6144
(
-2.7732e-21
0
-5.3581e-21
-2.7732e-21
3.6566e-20
-2.7732e-21
-5.3581e-21
7.943e-21
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0
0.0003125
0.000625
0.0009375
0.00125
0.0015625
0.001875
0.0021875
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0
0.0003125
0.000625
0.0009375
0.00125
0.0015625
0.001875
0.0021875
...
)
;
    }
    mantle
    {
        type            calculated;
        value           nonuniform List<scalar> 
1536
(
0.00048773
0.0014444
0.0023456
0.0031567
0.0038464
0.0043884
0.0047617
0.004952
...
)
;
    }
}


// ************************************************************************* //
